# Проект: Анализ вакансий из HeadHunter

Начинаем с импорта библиотек

In [4]:
import pandas as pd
import psycopg2

In [5]:
pd.__version__

'2.2.1'

In [6]:
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

Создаем соединение с заданными параметрами

In [7]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

##### Задание 3.1: Сколько вакансий есть в базе?

In [10]:
# код запроса
query_3_1 = f'''select count(name)
                from vacancies
             '''

In [11]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\2187130260.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

##### Задание 3.2: Сколько работодателей?

In [14]:
# код запроса
query_3_2 = f'''select count(id)
                from employers
             '''

In [15]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_3_2, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\92437936.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

   count
0  23501

##### Задание 3.3: Сколько регионов?

In [16]:
# код запроса
query_3_3 = f'''select count(id)
                from areas
             '''

In [17]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_3_3, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\2187136684.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection)

   count
0   1362

##### Задание 3.4: Сколько сфер деятельности?

In [18]:
# код запроса
query_3_4 = f'''select count(id)
                from industries
             '''

In [19]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_3_4, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\3866612738.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

   count
0    294

- Вывод по блоку заданий № 3: Из предварительного анализа данных в представленных таблицах прослеживается прямая взаимосвяз между собой по набору id, что в дальнейшем позволит проводить анализ данных и делать определенные выводы исходя из взаимосвязи.

##### Задание 4.1: Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area). Выберите пятёрку лидеров по количеству вакансий.

In [41]:
# код запроса
query_4_1 = f'''select 
                    a.name as "Регион",
                    count(v.id) as "Количество вакансий"
                from areas a
                join vacancies v ON v.area_id = a.id
                group by 1
                order by 2 DESC
                limit 5
             '''

In [42]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_4_1, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\3543039334.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

            Регион  Количество вакансий
0           Москва                 5333
1  Санкт-Петербург                 2851
2            Минск                 2112
3      Новосибирск                 2006
4           Алматы                 1892

##### Задание 4.2: Посмотрим на зарплаты. У какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой?

In [43]:
# код запроса
query_4_2 = f'''select count(vacancies.id) as "Количество вакансий"
                from vacancies
                where salary_from IS NOT NULL or salary_to IS NOT NULL
             '''

In [44]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_4_2, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\1729028985.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

   Количество вакансий
0                24073

##### Задание 4.3: Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого числа.

In [45]:
# код запроса
query_4_3 = f'''select
                    round (avg(salary_from)) as "средние по нижней границе заработной платы",
                    round (avg(salary_to)) AS "средние по верхней границе заработной платы"
                from vacancies
             '''

In [46]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_4_3, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\451535328.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

   средние по нижней границе заработ  средние по верхней границе зарабо
0                            71065.0                           110537.0

##### Задание 4.4: Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Какая пара находится на втором месте по популярности?

In [51]:
# код запроса
query_4_4 = f'''select 
                    vacancies.schedule as "Тип рабочего графика",
                    vacancies.employment as "Тип трудоустройства",
                    count(vacancies.id) as "Количество вакансий"
                from vacancies
                group by vacancies.schedule,vacancies.employment
                order by 3 desc
                limit 2
             '''

In [52]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_4_4, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\2844389134.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

  Тип рабочего графика Тип трудоустройства  Количество вакансий
0          Полный день    Полная занятость                35367
1     Удаленная работа    Полная занятость                 7802

##### Задание 4.5: Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [53]:
# код запроса
query_4_5 = f'''select 
                    vacancies.experience as "Опыт работы",
                    count(vacancies.id) as "Количество вакансий"
                from vacancies
                group by vacancies.experience
                order by 2
                limit 4
             '''

In [54]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_4_5, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\877495041.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

          Опыт работы  Количество вакансий
0         Более 6 лет                 1337
1           Нет опыта                 7197
2       От 3 до 6 лет                14511
3  От 1 года до 3 лет                26152

- Вывод по блоку заданий № 4: Исходя из анализа представленных данных прослеживается концентрация спроса на трудовые ресурсы в наиболее крупных городах миллионниках, со средней заработной платой от 70 до 100 тысяч, предпочтения полной занятости независимо от типа рабочего графика и небольшого количества вакансий не содержащих требований к опыту работы, как и имеющих повышенные требования к опыту работы более 6 лет.

##### Задание 5.1: Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [61]:
# код запроса
query_5_1 = f'''(select 
                     employers.name as "Название работодателя",
                     count(vacancies.id) as "Количество вакансий"
                 from employers
                 join vacancies on vacancies.employer_id = employers.id
                 group by employers.name
                 order by 2 desc
                 limit 1)
                union all
                (select 
                     employers.name as "Название работодателя",
                     count(vacancies.id) as "Количество вакансий"
                 from employers
                 join vacancies on vacancies.employer_id = employers.id
                 group by employers.name
                 order by 2 desc
                 offset 4 limit 1)
            '''

In [62]:
# результаты запроса сразу в виде датафрейма 

df = pd.read_sql_query(query_5_1, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\3760882056.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

  Название работодателя  Количество вакансий
0                Яндекс                 1933
1         Газпром нефть                  331

##### Задание 5.2: Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём. Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [65]:
# код запроса
query_5_2 = f'''
            select a.name "Название региона", count(distinct e.id) "Количество работодателей", count(distinct v.id) "Количество вакансий"
            from
                  areas a
                  left join employers e on a.id = e.area
                  left join vacancies v on v.area_id = a.id
            where v.id is null
            group by a.id
            order by 2 desc
            limit 1
            '''

In [66]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_5_2, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\3261255924.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

  Название региона  Количество работодателей  Количество вакансий
0           Россия                       410                    0

##### Задание 5.3: Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Выберите максимальное значение из получившегося списка.

In [69]:
# код запроса
query_5_3 = f'''select 
                    e.name "Название работодателя",
                    count(distinct v.area_id) "Количество регионов где публикуются вакансии",
                    count(distinct v.id) "Количество вакансий"
                from employers e
                join vacancies v on v.employer_id = e.id
                group by 1
                order by 3 desc
                limit 10
             '''

In [70]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_5_3, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\3033624204.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

,Название работодателя,Количество регионов где публикуют,Количество вакансий
0,Яндекс,181,1933
1,Ростелеком,152,491
2,Тинькофф,43,444
3,СБЕР,24,428
4,Газпром нефть,24,331
5,ИК СИБИНТЕК,46,327
6,МТС,55,292
7,DataArt,2,247
8,Совкомбанк Технологии,26,204
9,Первый Бит,43,176

##### Задание 5.4: Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [71]:
# код запроса
query_5_4 = f'''select count(*) cnt
                from employers e
                left join employers_industries ei on e.id = ei.employer_id
                where ei.industry_id is null
                '''

In [72]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_5_4, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\1651684398.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

    cnt
0  8419

##### Задание 5.5: Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [75]:
# код запроса
query_5_5 = f'''select count(ei.industry_id) "Количество сфер", e.name "Название работодателя"
                from employers e
                left join employers_industries ei on e.id = ei.employer_id
                group by e.id
                having count(ei.industry_id)=4
                order by 2
                offset 2 limit 1
                '''

In [76]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_5_5, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\731898222.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

   Количество сфер Название работодателя
0                4                  2ГИС

##### Задание 5.6: С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана «Разработка программного обеспечения».

In [77]:
# код запроса
query_5_6 = f'''select count(ei.industry_id) "Количество сфер"
                from industries i
                left join employers_industries ei on i.id = ei.industry_id
                group by i.id
                having i.name='Разработка программного обеспечения'
                '''

In [78]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_5_6, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_2420\3363201357.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

   Количество сфер
0             3553

##### Задание 5.7: Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании, собранных в этой таблице.

In [138]:
import requests
from bs4 import BeautifulSoup

url='https://ru.wikipedia.org/wiki/Города-миллионеры_России'
response=requests.get(url)
page=BeautifulSoup (response. text, 'html.parser')

cities_here=str(page.find( 'table', class_="standard"))
cities_here=cities_here.split('title="')[3:]

million_cities = []
#million_cities = tuple(million_cities) 
for i in cities_here:
    million_cities.append(i.split('">')[0])

In [184]:
# код запроса
query_5_7 = f'''
WITH temp AS 
            (select a.name as name, count(v.id) as cnt
            from employers e
            join vacancies v on e.id = v.employer_id
            join areas a on a.id = v.area_id
            where e.name = 'Яндекс' and a.name in {tuple(million_cities)}
            group by a.id)
            select temp.name,
                    temp.cnt
            from temp
            union all
            select 'Total', 
                    sum(temp.cnt)  
            from temp
'''

In [185]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_5_7, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_8780\4037940136.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection)

               name    cnt
0            Москва   54.0
1   Санкт-Петербург   42.0
2      Екатеринбург   39.0
3       Новосибирск   35.0
4         Волгоград   24.0
5           Воронеж   32.0
6         Краснодар   30.0
7        Красноярск   23.0
8   Нижний Новгород   36.0
9              Омск   21.0
10            Пермь   25.0
11   Ростов-на-Дону   25.0
12           Самара   26.0
13           Казань   25.0
14              Уфа   26.0
15        Челябинск   22.0
16            Total  485.0

- Вывод по заданию 5.7: Анализ данных по работодателям покозал, что наибольшее колличество вакансий в наибольшем количестве регионов где эти вакансии размещены у компаний из ИТ, телекома и финансового сектора. При этом наибольшея концентрация вакансий отмечается в городах с населением более 1 миллиона человек.

##### Задание 6.1: Сколько вакансий имеет отношение к данным?

In [186]:
# код запроса
query_6_1 = f'''select count(*)
                from vacancies
                where name ilike '%data%' or name ilike '%данн%'
                '''

In [187]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_6_1, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_8780\430608920.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   count
0   1771

##### Задание 6.2: Сколько есть подходящих вакансий для начинающего дата-сайентиста?

Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* ‘data scientist’;
* ‘data science’;
* ‘исследователь данных’;
* ‘ML’ (здесь не нужно брать вакансии по HTML);
* ‘machine learning’;
* ‘машинн%обучен%’.

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово “junior” или
* требуемый опыт — «Нет опыта» или
* тип трудоустройства — «Стажировка».

In [188]:
# код запроса
query_6_2 = f'''select count(*)
                from vacancies
                where (lower(vacancies.name) LIKE '%data scientist%' 
                or lower(vacancies.name) LIKE '%data science%' 
                or lower(vacancies.name) LIKE '%исследователь данных%' 
                or vacancies.name LIKE '%ML%' and vacancies.name NOT LIKE '%HTML%' 
                or lower(vacancies.name) LIKE '%machine learning%' 
                or lower(vacancies.name) LIKE '%машинн%обучен%') 
                and(lower(vacancies.name) LIKE '%junior%'
                or lower(vacancies.experience)='нет опыта'
                or lower(vacancies.employment)='стажировка')
                '''

In [189]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_6_2, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_8780\2825064127.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   count
0     51

##### Задание 6.3: Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

In [190]:
# код запроса
query_6_3 = f'''select count(*)
                from vacancies
                where (lower(vacancies.name) LIKE '%data scientist%' 
                or lower(vacancies.name) LIKE '%data science%' 
                or lower(vacancies.name) LIKE '%исследователь данных%' 
                or lower(vacancies.name) LIKE '%ml%' and vacancies.name NOT LIKE '%HTML%' and vacancies.name not like '%QML%' 
                or lower(vacancies.name) LIKE '%machine learning%' 
                or lower(vacancies.name) LIKE '%машинн%обучен%') 
                and(lower(vacancies.key_skills) LIKE '%postgres%'
                or lower(vacancies.key_skills) LIKE '%sql%')
                '''

In [191]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_6_3, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_8780\3709805219.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   count
0    229

##### Задание 6.4: С помощью запроса, аналогичного предыдущему, проверьте, насколько популярен Python в требованиях работодателей к DS. Вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

In [194]:
# код запроса
query_6_4 = f'''select count(*)
                from vacancies
                where (lower(vacancies.name) LIKE '%data scientist%' 
                or lower(vacancies.name) LIKE '%data science%' 
                or lower(vacancies.name) LIKE '%исследователь данных%' 
                or lower(vacancies.name) LIKE '%ml%' and vacancies.name NOT LIKE '%HTML%' and vacancies.name not like '%QML%' 
                or lower(vacancies.name) LIKE '%machine learning%' 
                or lower(vacancies.name) LIKE '%машинн%обучен%') 
                and(lower(vacancies.key_skills) LIKE '%python%')
                '''

In [195]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_8780\1639840439.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   count
0    357

##### Задание 6.5: Сколько ключевых навыков в среднем указывают в вакансиях для DS?

Ответ округлите до двух знаков после точки-разделителя.

In [214]:
# код запроса
query_6_5 = f'''select 
                    round(avg(length(key_skills) - length(replace(key_skills, CHR(9), ''))+1), 2)
                from vacancies
                where
                    (lower(name) like '%data scientist%'
                    or lower(name) like '%data science%'
                    or lower(name) like '%исследователь данных%'
                    or (name like '%ML%' and name not ilike '%HTML%')
                    or lower(name) like '%machine learning%'
                    or lower(name) like '%машинн%обучен%')
                    and upper(name) not like '%HTML%'
                    and key_skills is not null
             '''

In [215]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_6_5, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_8780\2940343815.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   round
0   6.41

##### Задание 6.6: Напишите запрос, позволяющий вычислить, какую зарплату для DS в среднем указывают для каждого типа требуемого опыта (уникальное значение из поля experience).

    При решении задачи примите во внимание следующее:

    1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
    2. Если заполнены оба поля с зарплатой, считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, его и считаем зарплатой по вакансии.
    3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null).
    Чтобы избежать этой ситуации, мы воспользуемся функцией coalesce, которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос select 1 + coalesce(null, 0).

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [228]:
# код запроса
query_6_6 = f'''select experience, round(avg(coalesce((salary_from+salary_to)/2, salary_from, salary_to))) as wage
                from vacancies 
                where (name ilike '%data science%'
                    or name ilike '%data scientist%'
                    or name ilike '%machine learning%'
                    or name ilike '%исследователь данных%'
                    or name ilike '%машинн%обучен%'
                    or (name like '%ML%' and name not like '%HTML%'))   
                group by 1 
             '''

In [229]:
# результаты запроса сразу в виде датафрейма 
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\ilyad\AppData\Local\Temp\ipykernel_8780\4110104214.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

           experience      wage
0         Более 6 лет       NaN
1           Нет опыта   74643.0
2  От 1 года до 3 лет  139675.0
3       От 3 до 6 лет  243115.0

- Общий вывод: Проведенный анализ данных показал возможность с использованием представленной базы данных определять количественные и качественные характеристики по различным типам данных, относящихся к вакансиям, работодателям, регионам и отраслям, определять различные взаимосвязи между разными разделами данных благодаря наличию связывающих данные параметра id. На примере вакансий относящихся к дата-сайентист, продемострирована возможность выявления данных по узким и спецефическим выборкам.